{
  "date": "2021-01-09T23:28:25.635Z",
  "title": "An intro to programming",
  "description": "Programming can be fun, but also stressful. If you don't mind breaking some keyboards, jump in. Yet that joy of figuring how something works and doing it, is by far more tasty than your favorite meal",
  "body": "# Weclome\nHey there! welcome to this blog. I would like to introduce myself, my name is Amine, a full-stack developer from Morocco. A make it work guy, that explain why I do more of the back-end work, it's like coffee and tea, both are part of the image, in the this case, I drink more tea than coffee.\n\n## Background\nI've been coding since, let's say 4 years. More than that if we consider the trick of \"inspect\" elements in Developer Tools, I and we the people who like to joke with their friends, used to change data in some element of a website and send it to our besties for some laugh. I've done this with wikipedia pages and school exam results pages.  \nI had no idea what programming was, doing that thing. When an element is hovered over and inspected, that Chrome developer tool page that appears with all of those lines of weird english text (What I learned later was HTML) didn't make sense, what made sense on the other hand was the how easy it's to edit the text:  \n- Hover of a word\n- Mouse click right\n- Inspect element  \n\nSimple steps, and then the dev tools would highlight that exact same word in the space of stuff you had no idea of what it's, all you had to do, is to edit that word and press enter, then enjoy the satistying feeling of making something your own (well, kinda of)  \nI've heard many stories of those who went into programming to make video games they enjoyed, or be part of the team building the next Halo game. I wasn't such person, yes the joy of playing video games made me sometimes question how they were made. But the thing that amazed me was how software in general be it video games, your browser you currently using to read this and applications were made, how they handle people interactions and why they respond the way they do.  \nI always prefer to think about things in their overall picture, if you came to me at that time and told me that I can build Google by learning HTML, you'll see me jump around placing tags into places, having files full of keywords and their respective search results and trying to make my mind into what's better to use for links, a tag or button tag? then my Google page would look soooo bad (even though I'll be amazed by my progress) compared to the original. But \"you can build Google by learning HTML\" you said, how wrong and correct you were.  \nYou see, by that point I'll already have hit Google with tons of question searching how can I make something like you, he's isn't shy to answer, and doesn't care if I'm a beginner or not, a bombard of keywords would come my way....embrace for impact!!!: \"you can't make Google without styling the HTML with CSS\", \"You need you to learn JavaScript\", \"you don't have to build it with CSS, just start with Bootstrap\"....  \nI don't know were I'm now, I asked a question, received answer, many with keywords I would mistake to someone's name, like is Bootstrap a school name?  \nYet, I'm so determined to build Google, it was done before, it's not impossible!  \nI close my room's door, I quit my friends and family, they wonder why I don't care and what's that thing I'm doing (programming? what's that....) and I dive into the rabbit hole of coding..  \nI click on each link and start reading those articles, just a few hours later, I feel bored, like yeah I know CSS is what making a page look good and now I can consider it like makeup, but there's no way am I reading all of that, it's intersting but the amount of words outfit the benefits. Right now you come to know that I'm a visual learner by fact. Switching to YouTube, I paste CSS into the search bar and press enter...like hundreds of videos show up... you better execuse me, the dive must continue.  \nLater on, after I succesfuly managed to replace the dopamine fueled by video games to that coded by programming, Google's image now lay in the center of the page. Just a few weeks before, anyone moving around in the house close to my room would have heard a combination of mouse clicking and smashing the table, are now hearing another combination of a keyboard firing the music of its keys more and also the smashing of the table (keeping the identity strong)  \nMy Google looks good, I can display another pages with search results... but hold on, I said page results, I have coded page with results like ones that shows bears and others for eagles, but I can't access those from my main page. Enters JavaScript, and.....school exams, as a full time student, it's time for a break from one thing into another without really a holiday in between.  \nCouple of weeks later, I'm back looking at were I've left, main search page, some search result pages, but no way to link between them. I've thought of a solution, let's make a button to open each of those search results and not to bother with actually displaying them based on the search query. Yet this is not a phone book, it a search engine, thus those searches must be dynamic, with a JavaScript course started lately, I've put hours into extracting the users search term, which page we should redirect them to and how to make this as dynamic as possible, that was succesful, but as you see, having pages with predifined search reasults isn't as dynamic as it could be, thus enters databases.  \nBy now, I was just making pages that performs the same tasks, which's display search results, each of them has the same elements, but with different texts. It's so sweet to delete all of them, and leave just one, which with database and JavaScript we can change its content to represent what the user's looking for.  \n\"Magic!\" that word that presumably every beginner has said ever, HTML to structure it, CSS to style it, JavaScript to maestro it and database for ease of access.  \nFor a beginner, this is fine, but there's no way Google is doing this for production, many things with this Google clone has to improve, and the quest is a long compaign.  \nI'm a make it work person, just from you saying that Google can be built with HTML was a key in the matrix to unlock other keys which are necessary to build Google. Imagining the full image's something I highly value, even if there was only a single key to start with, I gather it and open all other pathways to those keys that follows, and if none, find a solution.  \nA little disclaimer, I haven't built this Google clone, this was an example to explain the process which I hope it made it clear. What this story has to tell is to build a product you have or better you must build first a vision of it in its full image, this is to know what must mostly be done, what you can adapt and others to improve on the way to its success. Yet sometimes you may not have all the keys like this case, maybe some or just one, would you drop it, or use it to unlock the others.\n\nI'm Amine, a Software Developer, tea is my drink, philosphy is my speech, history is my inspiration and video games are my punching bag"
}